---
type: PulldownButtonData
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# PulldownButtonData

`Autodesk.Revit.UI.PulldownButtonData` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PulldownButtonData | — | `public PulldownButtonData ( string name , string text )` |